src/InformationRegisters/СостоянияЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеВерсииЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВерсийЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьЭлектронныйДокументВходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьЭлектронныйДокументИсходящий</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействияСНашейСтороны</Name>
					<Comment>Признак необходимости выполнения какого-либо действия с ЭД с нашей стороны</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СводныеСостоянияЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействияСоСтороныДругогоУчастника</Name>
					<Comment>Признак ожидания выполнения какого-либо действия со стороны другого участника ЭД</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СводныеСостоянияЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьПроизвольныйЭД</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПакетЭД</v8:Type>
						<v8:Type>cfg:CatalogRef.МЧД003</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйПутевойЛист</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьЭлектронныйДокументВходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектроннаяТранспортнаяНакладная</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьЭлектронныйДокументИсходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СпособыОбменаЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыОбменаЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезКаталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезОператораЭДОТакском</Name>
					<Comment>Через оператора электронного документооборота Такском</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезЭлектроннуюПочту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезВебРесурсБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезFTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БыстрыйОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезСервис1СЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимостиОтправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12Продавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прикладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/НаправленияЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интеркампани</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ОбменСГИСЭПДВызовСервера/Ext/Module.bsl
Функция ЗначенияРеквизитовОбъекта(Объект, Реквизиты) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект, Реквизиты);
	
КонецФункции

Функция НазваниеИВерсияПрограммы() Экспорт
	
	Возврат ОбменСГИСЭПД.НазваниеИВерсияПрограммы();
	
КонецФункции

Функция ДанныеСертификатаУчетнойЗаписиЭДО(ИдентификаторУчетнойЗаписи, ОтборПодписанта = Неопределено) Экспорт
	
	Возврат ОбменСГИСЭПД.ДанныеСертификатаУчетнойЗаписиЭДО(ИдентификаторУчетнойЗаписи, ОтборПодписанта);
	
КонецФункции

Функция ПолучитьПрокси(Схема) Экспорт
	
	Прокси = Неопределено;
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ПолучениеФайловИзИнтернетаПереопределенный");
		Прокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси(Схема);
	КонецЕсли;
	
	Возврат Прокси;
	
КонецФункции

Функция ЗаписатьОшибкуВЖурнал(ИмяСобытия, ИнформацияОбОшибке) Экспорт
	
	Возврат ОбменСГИСЭПД.ЗаписатьОшибкуВЖурнал(ИмяСобытия, ИнформацияОбОшибке);
	
КонецФункции

Функция СведенияОбАдресе(РезультатЗначение, ДополнительныеПараметры) Экспорт
	
	Возврат РаботаСАдресами.СведенияОбАдресе(РезультатЗначение, ДополнительныеПараметры, Ложь);
	
КонецФункции

Функция КонтактнаяИнформацияВXML(КонтактнаяИнформацияВладелец, ОжидаемыйВид) Экспорт
	
	Возврат ОбменСГИСЭПД.КонтактнаяИнформацияВXML(КонтактнаяИнформацияВладелец, ОжидаемыйВид);
	
КонецФункции


Функция ПредставлениеКонтактнойИнформации(КонтактнаяИнформация) Экспорт
	
	Возврат ОбменСГИСЭПД.ПредставлениеКонтактнойИнформации(КонтактнаяИнформация);
	
КонецФункции

Функция ПолучитьРеквизитыУчастника(Участник, ДобавитьПлатежныеРеквизиты = Ложь) Экспорт
	
	Возврат ОбменСГИСЭПД.ПолучитьРеквизитыУчастника(Участник, ДобавитьПлатежныеРеквизиты);
	
КонецФункции

Функция ПолучитьРеквизитыФизЛица(ФизЛицо, Организация = Неопределено) Экспорт
	
	Возврат ОбменСГИСЭПД.ПолучитьРеквизитыФизЛица(ФизЛицо, Организация);
	
КонецФункции

Функция НайтиЭлектронныйДокументОбъектаУчета(ОбъектУчета) Экспорт
	
	Возврат ОбменСГИСЭПД.НайтиЭлектронныйДокументОбъектаУчета(ОбъектУчета);
	
КонецФункции

Функция ДвоичныеДанныеДокументаЭПД(Объект, АдресВоВременномХранилище) Экспорт
	
	Возврат ОбменСГИСЭПД.ДвоичныеДанныеДокументаЭПД(Объект,, АдресВоВременномХранилище);
	
КонецФункции


Функция ПолучитьТипОрганизация() Экспорт
	
	Возврат ОбменСГИСЭПДСерверПовтИсп.ПолучитьТипОрганизация();	
	
КонецФункции

Функция ПолучитьТипКонтрагент() Экспорт
	
	Возврат ОбменСГИСЭПДСерверПовтИсп.ПолучитьТипКонтрагент();	
	
КонецФункции

Функция ПолучитьИдентификаторЧерезСервисОператораЭДО(ИдентификаторАбонента, ЭтоВторойТитул = Ложь, ДокументСсылка = Неопределено) Экспорт
	
	Возврат ОбменСГИСЭПД.ПолучитьИдентификаторЧерезСервисОператораЭДО(ИдентификаторАбонента, ЭтоВторойТитул, ДокументСсылка);
	
КонецФункции

Функция ПолучитьОписаниеОшибки(ОбъектСсылка) Экспорт
	
	Возврат ОбменСГИСЭПД.ПолучитьОписаниеОшибки(ОбъектСсылка);
	
КонецФункции

Функция ПолучитьСообщениеТитула(Документ, ТипЭлементаРегламента, ВернутьЭД = Ложь) Экспорт
	
	Возврат ОбменСГИСЭПД.ПолучитьСообщениеТитула(Документ, ТипЭлементаРегламента, ВернутьЭД);
	
КонецФункции

Функция СостояниеДокументаПодробное(ЭлектронныйДокумент) Экспорт
	
	Состояние = Новый Структура;
	Состояние.Вставить("Значение", Перечисления.СостоянияВерсийЭД.ПустаяСсылка());
	Состояние.Вставить("Дополнение", "");
	Состояние.Вставить("ДатаИзменения", '00010101');
	Состояние.Вставить("Комментарий", "");    
	
	СостояниеВерсииЭД = ЭлектронныеДокументыСлужебный.ПолучитьСтруктуруВерсииЭД(ЭлектронныйДокумент);
	
	СостояниеВерсииЭД.Свойство("СостояниеВерсииЭД", Состояние.Значение);
	СостояниеВерсииЭД.Свойство("КомментарийРС", Состояние.Комментарий);;
	
	Возврат Состояние;
	
КонецФункции

Функция ПолучитьТитулыПоДокументу(Документ, ТолькоЗавершенныеОтправки = Ложь) Экспорт

	Возврат ОбменСГИСЭПД.ПолучитьТитулыПоДокументу(Документ, ТолькоЗавершенныеОтправки);

КонецФункции

Функция ПолучитьВерсииТитуловДокумента(Знач Документ, Знач Организация) Экспорт

	Возврат ОбменСГИСЭПД.ПолучитьВерсииТитуловДокумента(Документ, Организация);

КонецФункции

Функция ПолучитьАдресаДоставки(ЗначениеОтбора) Экспорт
	
	Возврат ОбменСГИСЭПД.ПолучитьАдресаДоставки(ЗначениеОтбора);
	
КонецФункции

Процедура ОтметитьИсправлениеДокумента(ОбъектУчета) Экспорт
	
	ОбменСГИСЭПД.ОтметитьИсправлениеДокумента(ОбъектУчета);
	
КонецПроцедуры

Функция ВидФактическийАдресКонтрагента() Экспорт

	Возврат ОбменСГИСЭПДПереопределяемый.ВидФактическийАдресКонтрагента();
	
КонецФункции

Функция ИмяТипаБанковскиеСчетаОрганизации() Экспорт
	
	Возврат ОбменСГИСЭПДПереопределяемый.ИмяТипаБанковскиеСчетаОрганизации();
	
КонецФункции

Функция ЭтоУОУ(ТипЭлементаРегламента) Экспорт
	
	Возврат ОбменСГИСЭПД.ЭтоУОУ(ТипЭлементаРегламента);
	
КонецФункции

// Возвращает полное имя основной формы объекта.
//
// Параметры:
//  Ссылка	 - 	ЛюбаяСсылка - ссылка на объект. Например, ДокументСсылка или СправочникСсылка.
// 
// Возвращаемое значение:
//  Строка - полное имя основной формы объекта.
//
Функция ПолноеИмяФормыОбъекта(Ссылка) Экспорт
	
	ИмяФормы = "";
	ОбъектМетаданных = Ссылка.Метаданные();
	
	Если ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
		ИмяФормы = ОбъектМетаданных.ПолноеИмя() + ".ФормаОбъекта";
	ИначеЕсли ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		ИмяФормы = ОбъектМетаданных.Формы.ФормаЭлемента.ПолноеИмя();
	КонецЕсли;
		
	Возврат ИмяФормы;
	
КонецФункции

Процедура УстановитьПометкуУдаления(Ссылка) Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	Объект.УстановитьПометкуУдаления(НЕ Объект.ПометкаУдаления);
	
КонецПроцедуры

Функция ПолучитьУИДМинтранса(КлючСинхронизации, ЭтоВторойТитул = Ложь, ДокументСсылка = Неопределено) Экспорт
	
	РезультатПоУмолчанию = "";
	
	Если КлючСинхронизации = Неопределено Тогда
		Возврат РезультатПоУмолчанию;	
	КонецЕсли;           
	
	Если Лев(КлючСинхронизации.ИдентификаторОрганизации, 3) = "2AE" Тогда
		СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО;
	ИначеЕсли Лев(КлючСинхронизации.ИдентификаторОрганизации, 3) = "2AL" Тогда
		СпособОбмена = Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском;
	Иначе
		Шаблон = НСтр("ru='Оператор для абонента %1 не поддерживается.'");
		ТекстОшибки = СтрШаблон(Шаблон, КлючСинхронизации.ИдентификаторОрганизации);
		ВызватьИсключение(ТекстОшибки);
	КонецЕсли;
	
	HTTPСоединение = ЭлектронныеДокументыВнутренний.ПолучитьСоединение(СпособОбмена); 
	
	Если HTTPСоединение = Неопределено Тогда
		Возврат РезультатПоУмолчанию;
	КонецЕсли;
	
	АдресРесурса = "epd/v1/GetUID/" + КлючСинхронизации.ИдентификаторОрганизации;
	Если ЭтоВторойТитул = Истина И ДокументСсылка <> Неопределено Тогда
		ЭД = ОбменСГИСЭПД.ОсновнойЭлектронныйДокументОбъектаУчета(ДокументСсылка);
		Если ЗначениеЗаполнено(ЭД) Тогда
			ПерваяТранзакция = Неопределено;
			Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная") Тогда
				ПерваяТранзакция = "ShipperInformation";		
			ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЭлектронныйПутевойЛист") Тогда
				ПерваяТранзакция = "OwnerVehicleInfo";	
			КонецЕсли;
			АдресРесурса = АдресРесурса + "?docflow_id=" + ЭД.ИдентификаторДокументооборота;
			Если ПерваяТранзакция <> Неопределено Тогда	
				АдресРесурса = АдресРесурса + "&transaction=" + ПерваяТранзакция;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	
	ОтветHTTP = HTTPСоединение.Получить(ЗапросHTTP);
	Если ОтветHTTP.КодСостояния = 200 Тогда
		Возврат ОтветHTTP.ПолучитьТелоКакСтроку();
	Иначе
		Возврат РезультатПоУмолчанию;
	КонецЕсли;
					
КонецФункции

Функция ПолучитьПочтуВодителей(МассивВодители, ИмяРеквизита = "Почта") Экспорт
	
	Возврат ОбменСГИСЭПД.ПолучитьПочтуВодителей(МассивВодители, ИмяРеквизита);
	
КонецФункции

Функция ДанныеРеквизитовЭПД(Документ, Титул = Неопределено, ВсеВерсии = Ложь) Экспорт
	
	Возврат ОбменСГИСЭПД.ДанныеРеквизитовЭПД(Документ, Титул, ВсеВерсии);
		
КонецФункции

Функция ПолучитьОписаниеХранимыхДанныхЭПДПоСсылке(ХранимыеДанныеЭПДСсылка, ГруппаДанных, ИдентификаторСтроки = Неопределено) Экспорт
	
	Возврат ОбменСГИСЭПД.ПолучитьОписаниеХранимыхДанныхЭПДПоСсылке(ХранимыеДанныеЭПДСсылка, ГруппаДанных, ИдентификаторСтроки);
	
КонецФункции

Процедура АвтоПодборХранимыхДанныхЭПД(СтрокаПоиска, ДанныеВыбора, Отбор) Экспорт
	
	ОбменСГИСЭПД.АвтоПодборХранимыхДанныхЭПД(СтрокаПоиска, ДанныеВыбора, Отбор);
	
КонецПроцедуры

Функция ПроверитьЗаполнениеДокументаЭПД(ДанныеДляПроверки, ТекущийТитул, ВидДокумента) Экспорт
	
	Возврат ОбменСГИСЭПД.ПроверитьЗаполнениеДокументаЭПД(ДанныеДляПроверки, ТекущийТитул, ВидДокумента)
	
КонецФункции

Функция ВидФактическийАдресОрганизации() Экспорт

	Возврат ОбменСГИСЭПДПереопределяемый.ВидФактическийАдресОрганизации();
	
КонецФункции


// Область ХранимыеДанные

Функция ЗаписатьХранимыеДанныеЭПД(ГруппаДанных, Организация, Контрагент, ДополнительныйОтбор, ОписаниеДанных) Экспорт
										
	Возврат ОбменСГИСЭПД.ЗаписатьХранимыеДанныеЭПД(ГруппаДанных, Организация, Контрагент, ДополнительныйОтбор, ОписаниеДанных);
										
КонецФункции

Функция НастройкиОтправки(КлючНастроекОтправки, Направление = Неопределено) Экспорт
	
	Результат = ОбменСГИСЭПД.НастройкиОтправки(КлючНастроекОтправки, Направление);
	Если Результат = "" Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// КонецОбласти

// Область СовместимостьСБЭД19

Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	Возврат ОбменСГИСЭПД.ПодсистемаСуществует(ПолноеИмяПодсистемы);
	
КонецФункции

Функция НовыеПараметрыПолученияСостоянияНеНачатогоЭДООбъектаУчета() Экспорт
	
	ДанныеСостояния = Новый ТаблицаЗначений;
	ДанныеСостояния.Колонки.Добавить("ОбъектУчета");
	ДанныеСостояния.Колонки.Добавить("Контрагент");
	ДанныеСостояния.Колонки.Добавить("ТипДокумента");
	ДанныеСостояния.Колонки.Добавить("ПрикладнойТипДокумента");
	ДанныеСостояния.Колонки.Добавить("Направление");
	ДанныеСостояния.Колонки.Добавить("Организация");
	ДанныеСостояния.Колонки.Добавить("Договор");
	
	Возврат ДанныеСостояния;
	
КонецФункции

// Возвращает наличие у пользователя прав на настройку ЭДО.
//
// Параметры:
//  ВыводитьСообщение - Булево - признак необходимости выводить сообщение о нарушении прав доступа.
//
// Возвращаемое значение:
//  Булево - Истина, если у пользователя есть необходимые права, иначе Ложь.
//
Функция ЕстьПравоНастройкиОбмена(ВыводитьСообщение = Ложь) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = Истина;
	
	// Основные объекты метаданных, доступ к которым определяет доступ к элементарной функции.
	ОбъектыЭлементарнойФункции = Новый Массив;
	ОбъектыЭлементарнойФункции.Добавить(Метаданные.Справочники.СоглашенияОбИспользованииЭД);
	
	Для каждого Объект Из ОбъектыЭлементарнойФункции Цикл
		
		Если Не ПравоДоступа("Изменение", Объект) Тогда
			ЕстьПраво = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьПраво;
	
КонецФункции

// Возвращает имена подсистем для использования в см. ЗаписатьВЖурналРегистрации.
// 
// Возвращаемое значение:
// 	Структура:
// * ЭлектронноеВзаимодействие - Строка
// * ОбменСБанками - Строка
// * ОбменСКонтрагентами - Строка
// * ОбменССайтами - Строка
// * РегламентныеЗадания - Строка
// * БизнесСеть - Строка
// * ТорговыеПредложения - Строка
// * ИнтеграцияСЯндексКассой - Строка
// * СопоставлениеНоменклатурыКонтрагентов - Строка
// * Криптография - Строка
// * СервисДоставки - Строка
// * ЭлектронноеАктированиеЕИС - Строка
// * КоммерческиеПредложения - Строка
Функция ПодсистемыБЭД() Экспорт
	
	Подсистемы = Новый Структура;
	Подсистемы.Вставить("ЭлектронноеВзаимодействие", "ЭлектронноеВзаимодействие");
	Подсистемы.Вставить("ОбменСБанками", "ЭлектронноеВзаимодействие.ОбменСБанками");
	Подсистемы.Вставить("ОбменСКонтрагентами", "ЭлектронноеВзаимодействие.ОбменСКонтрагентами");
	Подсистемы.Вставить("ОбменССайтами", "ЭлектронноеВзаимодействие.ОбменССайтами");
	Подсистемы.Вставить("РегламентныеЗадания", "РегламентныеЗадания");
	Подсистемы.Вставить("БизнесСеть", "ЭлектронноеВзаимодействие.БизнесСеть");
	Подсистемы.Вставить("ТорговыеПредложения", "ЭлектронноеВзаимодействие.ТорговыеПредложения");
	Подсистемы.Вставить("ИнтеграцияСЯндексКассой", "ЭлектронноеВзаимодействие.ИнтеграцияСЯндексКассой");
	Подсистемы.Вставить("СопоставлениеНоменклатурыКонтрагентов",
		"ЭлектронноеВзаимодействие.СопоставлениеНоменклатурыКонтрагентов");
	Подсистемы.Вставить("Криптография", "ЭлектронноеВзаимодействие.БазоваяФункциональность.Криптография");
	Подсистемы.Вставить("ИнтернетСоединение", "ЭлектронноеВзаимодействие.БазоваяФункциональность.ИнтернетСоединение");
	Подсистемы.Вставить("РаботаСФайлами", "ЭлектронноеВзаимодействие.БазоваяФункциональность.РаботаСФайлами");
	Подсистемы.Вставить("СервисДоставки", "ЭлектронноеВзаимодействие.СервисДоставки");
	Подсистемы.Вставить("ЭлектронноеАктированиеЕИС", "ЭлектронноеАктированиеЕИС");	
	Подсистемы.Вставить("КоммерческиеПредложения", "ЭлектронноеВзаимодействие.КоммерческиеПредложения");
	
	Возврат Подсистемы;
	
КонецФункции

// Возвращает пустое описание объекта учета.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
// * Направление - ПеречислениеСсылка.НаправленияЭД
// * ТипДокумента - ПеречислениеСсылка.ТипыЭД
// * ПрикладнойТипДокумента - ОпределяемыйТип.ПрикладныеТипыЭлектронныхДокументовЭДО
// * Организация - ОпределяемыйТип.Организация
// * Контрагент - ОпределяемыйТип.УчастникЭДО
// * Договор - ОпределяемыйТип.ДоговорСКонтрагентомЭДО
Функция НовоеОписаниеОбъектаУчета() Экспорт
	
	ОписаниеОбъектаУчета = Новый ТаблицаЗначений;
	
	ТипыОбъектУчета = Новый Массив;
	ТипыОбъектУчета.Добавить(Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная"));
	ТипыОбъектУчета.Добавить(Тип("ДокументСсылка.ЭлектронныйПутевойЛист"));
	ТипыОбъектУчета.Добавить(Тип("ДокументСсылка.ЭлектронныйДокументВходящий"));
	ТипыОбъектУчета.Добавить(Тип("ДокументСсылка.ЭлектронныйДокументИсходящий"));
	ТипыОбъектУчета_Организация = Новый Массив;
	ТипыОбъектУчета_Организация.Добавить(Тип("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Организации")));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыОбъектУчета, ТипыОбъектУчета_Организация);
	
	ОписаниеОбъектаУчета.Колонки.Добавить("ОбъектУчета", Новый ОписаниеТипов(ТипыОбъектУчета));
	ОписаниеОбъектаУчета.Колонки.Добавить("Направление", Новый ОписаниеТипов("ПеречислениеСсылка.НаправленияЭД"));
	ОписаниеОбъектаУчета.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЭД"));
	ОписаниеОбъектаУчета.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Организации")));
	ОписаниеОбъектаУчета.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Контрагенты")));
	ОписаниеОбъектаУчета.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("ДоговорыКонтрагентов")));
	
	Возврат ОписаниеОбъектаУчета;
	
КонецФункции

// Возвращает описание полей ключа настроек отправки, см. ТекстЗапросаДополнениеНастройкамиВнутреннегоЭДО.
// 
// Возвращаемое значение:
// 	Структура:
// * Организация - Строка
// * ВидДокумента - Строка
Функция НовоеОписаниеПолейКлючаНастройкиВнутреннегоЭДО() Экспорт
	
	ПоляКлючаНастройки = Новый Структура;
	ПоляКлючаНастройки.Вставить("Организация", "");
	ПоляКлючаНастройки.Вставить("ВидВнутреннегоДокумента", "");
	
	Возврат ПоляКлючаНастройки;
	
КонецФункции

// Возвращает ссылку на основной электронный документ объекта учета.
// 
// Параметры:
//  ОбъектУчета - ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО
//
// Возвращаемое значение:
//  ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, Неопределено - ссылка на электронный документ.
//  Неопределено - электронный документ не найден.
//
Функция ОсновнойЭлектронныйДокументОбъектаУчета(Знач ОбъектУчета) Экспорт
	
	Возврат ОбменСГИСЭПД.ОсновнойЭлектронныйДокументОбъектаУчета(ОбъектУчета);
	
КонецФункции

// Заполняет данные состояния не начатого ЭДО объекта учета.
// 
// Параметры:
//  Параметры - См. НовоеОписаниеОбъектаУчета
//  ДанныеСостояния - См. НовыеДанныеСостоянияЭДООбъектаУчета
Процедура ЗаполнитьСостояниеНеНачатогоЭДООбъектаУчета(Параметры, ДанныеСостояния) Экспорт
	
	Если ДанныеСостояния = Неопределено Тогда
		ДанныеСостояния = НовыеДанныеСостоянияЭДООбъектаУчета();
	КонецЕсли;
	
	ДанныеСостояния.ЭтоСостояниеНеНачатогоЭДО = Истина;
	КоличествоПараметров = Параметры.Количество();
	КоличествоНетНастройки = 0;
	КоличествоФормированиеЗапрещено = 0;
	
	Для каждого СтрокаПараметров Из Параметры Цикл
		
		КлючНастроек = ОбменСГИСЭПДКлиентСервер.НовыйКлючНастроекОтправки();
		ТипДокументаДляВида = ?(СтрокаПараметров.ТипДокумента = Перечисления.ВидыЭД.Прикладной,
			СтрокаПараметров.ПрикладнойТипДокумента, СтрокаПараметров.ТипДокумента);
		КлючНастроек.ВидДокумента = ОбменСГИСЭПД.ВидДокументаПоТипу(ТипДокументаДляВида);
		КлючНастроек.Отправитель = СтрокаПараметров.Организация;
		КлючНастроек.Получатель = СтрокаПараметров.Контрагент;
		КлючНастроек.Договор = СтрокаПараметров.Договор;
		
		НастройкиОтправки = ОбменСГИСЭПД.НастройкиОтправки(КлючНастроек);
		
		Если Не ЗначениеЗаполнено(НастройкиОтправки) Тогда
			КоличествоНетНастройки = КоличествоНетНастройки + 1;
		ИначеЕсли Не НастройкиОтправки.Формировать Тогда
			КоличествоФормированиеЗапрещено = КоличествоФормированиеЗапрещено + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоНетНастройки = КоличествоПараметров Тогда
		
		ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Требуется настройка'");
		ДанныеСостояния.НеобходимаНастройка = Истина;
		
		Если КоличествоПараметров = 1 Тогда
			Если Параметры[0].Направление = Перечисления.НаправленияЭД.Исходящий
				Или Параметры[0].Направление = Перечисления.НаправленияЭД.Интеркампани Тогда
				ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Не начат'");
			ИначеЕсли Параметры[0].Направление = Перечисления.НаправленияЭД.Входящий Тогда
				ШаблонТекстаНавигационнойСсылки = НСтр("ru = 'Пригласить %1 к обмену электронными документами в 1С-ЭДО'");
				ДанныеСостояния.ПредставлениеСостояния = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонТекстаНавигационнойСсылки, Параметры[0].Контрагент);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли КоличествоФормированиеЗапрещено = КоличествоПараметров Тогда
		
		ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Формирование документов запрещено'");
		ДанныеСостояния.НеобходимаНастройка = Истина;
		
	Иначе
		
		ДанныеСостояния.СуществуетАктуальныйДокумент =
			ЗначениеЗаполнено(ОсновнойЭлектронныйДокументОбъектаУчета(Параметры[0].ОбъектУчета));
		ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Не начат'");
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает описание набора электронных документов по основанию.
// 
// Параметры:
//  ИсточникДанных - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
// 
// Возвращаемое значение:
//  См. НовоеОписаниеОбъектаУчета
//
Функция ОписаниеОбъектаУчета(ИсточникДанных) Экспорт
	
	Описание = НовоеОписаниеОбъектаУчета();
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ИсточникДанных) Тогда
		ИсточникДанныхСсылка = ИсточникДанных;
	Иначе // передан объект.
		ИсточникДанныхСсылка = ИсточникДанных.Ссылка;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
		МодульПодсистемы = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменСГИСЭПДСлужебный");
		ЭтоЭПД = МодульПодсистемы.ЭтоЭПД(ИсточникДанныхСсылка);
	Иначе
		ЭтоЭПД = Ложь;
	КонецЕсли;
	
	СправочникОрганизации = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Организации");
	ДоговорыКонтрагентов = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("ДоговорыКонтрагентов");
	
	ОграничениеТипаДоговорКонтрагента = Новый ОписаниеТипов("СправочникСсылка." 
		+ ДоговорыКонтрагентов);
	ПараметрыИсточника = Новый Структура;
	ПараметрыИсточника.Вставить("Тип");
	ПараметрыИсточника.Вставить("ФормированиеУниверсальногоДокумента");
	ПараметрыИсточника.Вставить("Направление");
	ПараметрыИсточника.Вставить("Организация");
	ПараметрыИсточника.Вставить("Контрагент");
	ПараметрыИсточника.Вставить("ДоговорКонтрагента", ОграничениеТипаДоговорКонтрагента.ПривестиЗначение());
	ПараметрыИсточника.Вставить("СоглашениеЭД");
	ПараметрыИсточника.Вставить("Партнер");
	
	ТипИсточникаДанных = ТипЗнч(ИсточникДанныхСсылка);
	
	Если ЭтоЭПД = Истина Тогда
		
		МодульДокумента = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменСГИСЭПД");
		МодульДокумента.ЗаполнитьПараметрыЭлектронногоДокумента(ИсточникДанных, ПараметрыИсточника);

		СтрокаОписания = Описание.Добавить();

		СтрокаОписания.ОбъектУчета = ИсточникДанныхСсылка;
		СтрокаОписания.ТипДокумента = ПараметрыИсточника.Тип;
		СтрокаОписания.Направление  = ПараметрыИсточника.Направление;
		СтрокаОписания.Организация  = ПараметрыИсточника.Организация;
		СтрокаОписания.Контрагент   = ПараметрыИсточника.Контрагент;
		СтрокаОписания.Договор      = ПараметрыИсточника.ДоговорКонтрагента;
		
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

Функция СохраненноеПредставлениеСостоянияЭДООбъектаУчета(ОбъектУчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияЭД.ПредставлениеСостояния КАК ПредставлениеСостояния
	|ИЗ
	|	РегистрСведений.СостоянияЭД КАК СостоянияЭД
	|ГДЕ
	|	СостоянияЭД.СсылкаНаОбъект = &СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ОбъектУчета);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.ПредставлениеСостояния;
		
	КонецЕсли;

	Возврат "";

КонецФункции

// Определяет, используется ли обмен электронными документами с контрагентами.
// 
// Параметры:
// 	КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// Возвращаемое значение:
// 	Булево
Функция ИспользуетсяОбменЭлектроннымиДокументами(КонтекстДиагностики = Неопределено) Экспорт
	
	Если ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьЗначениеФункциональнойОпции("ИспользоватьОбменЭД") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает новые данные состояния ЭДО объекта учета.
// 
// Параметры:
//  ВыполнитьНачальноеЗаполнение - Булево
// 
// Возвращаемое значение:
//  Структура:
// * ИспользуетсяОбменЭлектроннымиДокументами - Булево
// * ЕстьПравоНастройки - Булево
// * ПредставлениеСостояния - Строка
// * СуществуетАктуальныйДокумент - Булево
// * НеобходимаНастройка - Булево
// * ЭтоСостояниеНеНачатогоЭДО - Булево
Функция НовыеДанныеСостоянияЭДООбъектаУчета(ВыполнитьНачальноеЗаполнение = Истина)
	
	ДанныеСостояния = Новый Структура;
	ДанныеСостояния.Вставить("ИспользуетсяОбменЭлектроннымиДокументами", Ложь);
	ДанныеСостояния.Вставить("ЕстьПравоНастройки", Ложь);
	ДанныеСостояния.Вставить("ПредставлениеСостояния", "");
	ДанныеСостояния.Вставить("СуществуетАктуальныйДокумент", Ложь);
	ДанныеСостояния.Вставить("НеобходимаНастройка", Ложь);
	ДанныеСостояния.Вставить("ЭтоСостояниеНеНачатогоЭДО", Ложь);
	
	Если ВыполнитьНачальноеЗаполнение Тогда
		ДанныеСостояния.ИспользуетсяОбменЭлектроннымиДокументами = ИспользуетсяОбменЭлектроннымиДокументами();
		ДанныеСостояния.ЕстьПравоНастройки = ЕстьПравоНастройкиОбмена()
	КонецЕсли;

	Возврат ДанныеСостояния;

КонецФункции

// ИнтеграцияЭДОВызовСервера.ДанныеСостоянияЭДОДляФормыОбъектаУчета(Объект.Ссылка)
Функция ДанныеСостоянияЭДОДляФормыОбъектаУчета(ОбъектУчета) Экспорт
	
	Результат = НовыеДанныеСостоянияЭДООбъектаУчета();
	
	Если Результат.ИспользуетсяОбменЭлектроннымиДокументами Тогда
		Если ЗначениеЗаполнено(ОбъектУчета) Тогда	
			ПредставлениеСостояния = СохраненноеПредставлениеСостоянияЭДООбъектаУчета(ОбъектУчета);
			
			Если ПустаяСтрока(ПредставлениеСостояния) Тогда
				ОписаниеОбъектаУчета = ОписаниеОбъектаУчета(ОбъектУчета);
				
				ПараметрыПолученияСостояния = НовыеПараметрыПолученияСостоянияНеНачатогоЭДООбъектаУчета();
				Для каждого СтрокаОписания Из ОписаниеОбъектаУчета Цикл
					ЗаполнитьЗначенияСвойств(ПараметрыПолученияСостояния.Добавить(), СтрокаОписания);
				КонецЦикла;
				
				ЗаполнитьСостояниеНеНачатогоЭДООбъектаУчета(ПараметрыПолученияСостояния, Результат);
			Иначе
				Результат.ПредставлениеСостояния = ПредставлениеСостояния;
				Результат.СуществуетАктуальныйДокумент = ЗначениеЗаполнено(
					ОсновнойЭлектронныйДокументОбъектаУчета(ОбъектУчета));
				Результат.НеобходимаНастройка = Ложь;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ДанныеСостоянияЭДОДляФормыОбъектаУчета()

Функция СоответствиеПрофилейИД(МассивИдентификаторов) Экспорт
	
	ЗапросПрофиля = Новый Запрос;     
	ЗапросПрофиля.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	ЗапросПрофиля.Текст = "ВЫБРАТЬ
	                      |	ПрофилиНастроекЭДО.Ссылка,
	                      |	ПрофилиНастроекЭДО.ИдентификаторОрганизации
	                      |ИЗ
	                      |	Справочник.ПрофилиНастроекЭДО КАК ПрофилиНастроекЭДО
	                      |ГДЕ
	                      |	ПрофилиНастроекЭДО.ИдентификаторОрганизации В(&МассивИдентификаторов)"; 
	
	ВыборкаПрофиль = ЗапросПрофиля.Выполнить().Выбрать();            
	
	СоответствиеПрофилейИД = Новый Соответствие;
	Пока ВыборкаПрофиль.Следующий() Цикл
		СоответствиеПрофилейИД.Вставить(ВыборкаПрофиль.ИдентификаторОрганизации, ВыборкаПрофиль.Ссылка);
	КонецЦикла;     
	
	Возврат СоответствиеПрофилейИД;
	
КонецФункции

Функция ВариантыАвтоподбораАдреса(Текст) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.АдресныйКлассификатор") Тогда
		МодульАдресныйКлассификаторСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("АдресныйКлассификаторСлужебный");
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТолькоВебСервис", Истина);
		Возврат МодульАдресныйКлассификаторСлужебный.ВариантыАвтоподбора(Текст, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
